; domain
(define (domain knight)
    (:requirements :strips)
    (:predicates
        (at ?p ?x ?y)
        (occupied ?x ?y)
        (delta1 ?y1 ?y2) ;?y1 & ?y2 adjacent
        (delta2 ?y1 ?y2) ;?y1 & ?y2 separated by one square
    )
    (:action move
      :parameters (?p ?x1 ?y1 ?x2 ?y2)
      :precondition (and
        (at ?p ?x1 ?y1)
        (not (occupied ?x2 ?y2))
        (or (and (delta1 ?x1 ?x2) (delta2 ?y1 ?y2))
            (and (delta1 ?y1 ?y2) (delta2 ?x1 ?x2))
        )
      )
      :effect (and
        (not(at ?p ?x1 ?y1))
        (at ?p ?x2 ?y2)
        (occupied ?x2 ?y2)
        (not (occupied ?x1 ?y1))
      )
    )
)

; problem
(define (problem dual-knight-problem)
    (:domain knight)
    (:objects
        knight1 knight2
        x1 x2 x3 x4 x5 x6 x7
        y1 y2 y3 y4 y5 y6 y7 y8
    )
    (:init
        (at knight1 x1 y1)
        (at knight2 x7 y8)

        (occupied x2 y3)
        (occupied x6 y6)

        (delta1 x1 x2)
        (delta1 x2 x1)
        (delta1 x2 x3)
        (delta1 x3 x2)
        (delta1 x3 x4)
        (delta1 x4 x3)
        (delta1 x4 x5)
        (delta1 x5 x4)
        (delta1 x5 x6)
        (delta1 x6 x5)
        (delta1 x6 x7)
        (delta1 x7 x6)

        (delta1 y1 y2)
        (delta1 y2 y1)
        (delta1 y2 y3)
        (delta1 y3 y2)
        (delta1 y3 y4)
        (delta1 y4 y3)
        (delta1 y4 y5)
        (delta1 y5 y4)
        (delta1 y5 y6)
        (delta1 y6 y5)
        (delta1 y6 y7)
        (delta1 y7 y6)
        (delta1 y7 y8)
        (delta1 y8 y7)

        (delta2 x1 x3)
        (delta2 x2 x4)
        (delta2 x3 x1)
        (delta2 x3 x5)
        (delta2 x4 x2)
        (delta2 x4 x6)
        (delta2 x5 x3)
        (delta2 x5 x7)
        (delta2 x6 x4)
        (delta2 x7 x5)

        (delta2 y1 y3)
        (delta2 y2 y4)
        (delta2 y3 y1)
        (delta2 y3 y5)
        (delta2 y4 y2)
        (delta2 y4 y6)
        (delta2 y5 y3)
        (delta2 y5 y7)
        (delta2 y6 y4)
        (delta2 y6 y8)
        (delta2 y7 y5)
        (delta2 y8 y6)
    )
    (:goal (and
        (at knight1 x7 y8)
        (at knight2 x1 y1)
    ))
)

; plan
1. (move knight1 x1 y1 x3 y2)
   deleted: (at knight1 x1 y1)
   added: (at knight1 x3 y2) (occupied x3 y2)
   goals met: 0 of 2
2. (move knight1 x3 y2 x2 y4)
   deleted: (at knight1 x3 y2) (occupied x3 y2)
   added: (at knight1 x2 y4) (occupied x2 y4)
   goals met: 0 of 2
3. (move knight1 x2 y4 x4 y5)
   deleted: (at knight1 x2 y4) (occupied x2 y4)
   added: (at knight1 x4 y5) (occupied x4 y5)
   goals met: 0 of 2
4. (move knight2 x7 y8 x5 y7)
   deleted: (at knight2 x7 y8)
   added: (at knight2 x5 y7) (occupied x5 y7)
   goals met: 0 of 2
5. (move knight2 x5 y7 x3 y6)
   deleted: (at knight2 x5 y7) (occupied x5 y7)
   added: (at knight2 x3 y6) (occupied x3 y6)
   goals met: 0 of 2
6. (move knight2 x3 y6 x2 y4)
   deleted: (at knight2 x3 y6) (occupied x3 y6)
   added: (at knight2 x2 y4) (occupied x2 y4)
   goals met: 0 of 2
7. (move knight2 x2 y4 x3 y2)
   deleted: (at knight2 x2 y4) (occupied x2 y4)
   added: (at knight2 x3 y2) (occupied x3 y2)
   goals met: 0 of 2
8. (move knight2 x3 y2 x1 y1)
   deleted: (at knight2 x3 y2) (occupied x3 y2)
   added: (at knight2 x1 y1) (occupied x1 y1)
   goals met: 1 of 2
9. (move knight1 x4 y5 x5 y7)
   deleted: (at knight1 x4 y5) (occupied x4 y5)
   added: (at knight1 x5 y7) (occupied x5 y7)
   goals met: 1 of 2
10. (move knight1 x5 y7 x7 y8)
   deleted: (at knight1 x5 y7) (occupied x5 y7)
   added: (at knight1 x7 y8) (occupied x7 y8)
   goals met: 2 of 2
